Repository: mhdabdellah/ceni_tracker_mobile_app
Catalog: ceni_scanner/lib/l10n/app_*.arb
Languages: ar, fr

# failedToScanQRCode
source: QR code cannot be scanned
ar: رمز الاستجابة السريعة غير قابل للمسح
fr: Échec de la lecture du QR Code

source: Failed to get platform version
ar: فشل في الحصول على إصدار النظام الأساسي
fr: Échec de l'obtention de la version de la plateforme

source: Cancel
ar: إلغاء
fr: Annuler

source: Failed to get location
ar: فشل في الحصول على الموقع
fr: Échec de l'obtention de la localisation

source: Location permission denied by user
ar: تم رفض إذن الموقع من قبل المستخدم
fr: Autorisation de localisation refusée par l'utilisateur

source: OK
ar: موافق

source: Send
ar: إرسال
fr: Envoyer

source: Alert
ar: تنبيه
fr: Alerte

source: Detected
ar: تم الكشف
fr: Détecté

# recu
source: Received
ar: استلم
fr: Reçu

# materalCode
source: Material code
ar: رمز المادة
fr: Code matériel

source: Latitude
ar: خط العرض

source: Longitude
ar: خط الطول

# codeDestination
source: Destination code
ar: رمز الوجهة
fr: Code de destination

source: Destination
ar: الوجهة

source: Source
ar: مصدر

source: Type
ar: نوع

# leMaterielEstArriveALaDestination
source: Material has arrived at the destination
ar: وصلت المواد إلى الوجهة
fr: Le matériel est arrivé à destination

# suiviDesMateriels
source: Material tracking
ar: تتبع المواد
fr: Suivi des Matériels

# materielRecu
source: Material received
ar: تم استلام المواد
fr: Matériel reçu

source: Network error
ar: خطأ في الشبكة
fr: Erreur réseau

source: Failed
ar: فشل
fr: Échec

# objectIsAlertedSuccessfully
source: Object alerted successfully
ar: تم تنبيه بالعنصر بنجاح
fr: Objet averti avec succès

# objectIsDetectedSuccessfully
source: Object detected successfully
ar: تم اكتشاف العنصظ بنجاح
fr: Objet détecté avec succès

# objectIsSendedSuccessfully
source: Object sent successfully
ar: تم إرسال العنصظ بنجاح
fr: Objet envoyé avec succès

# objectIsReceivedSuccessfully
source: Object received successfully
ar: تم استلام العنصظ بنجاح
fr: Objet reçu avec succès

# failedtoSendPosition
source: Failed to send location
ar: فشل في إرسال الموقع
fr: Échec de l'envoi de la position

source: QR code scanner
ar: ماسح رمز الاستجابة السريعة
fr: Scanner de QR Code

source: Scanned code
ar: الرمز الممسوح ضوئيا
fr: Code scanné

source: CENI scanner
ar: ماسح ضوئي CENI
fr: Scanner CENI

# ceniScanner
source: CENIS Scanner
ar: ماسح CENIS
fr: CENI Scanner

source: Code
ar: الرمز

source: Get Material Informations
ar: الحصول على معلومات المواد
fr: Obtenir des informations sur le matériel

# pasObjectscannee
source: No object scanned
ar: لم يتم مسح أي كائن
fr: Il n'y a pas d'objet scanné

source: Home
ar: الصفحة الرئيسية
fr: Accueil

source: Change Password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: New passwords do not match
ar: كلمات المرور الجديدة غير متطابقة
fr: Les nouveaux mots de passe ne correspondent pas

source: Please confirm your new password
ar: يرجى تأكيد كلمة المرور الجديدة الخاصة بك
fr: Veuillez confirmer votre nouveau mot de passe

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة
fr: Confirmer le nouveau mot de passe

source: Please enter a new password
ar: يرجى إدخال كلمة مرور جديدة
fr: Veuillez entrer un nouveau mot de passe

source: New password
ar: كلمة المرور الجديدة
fr: Nouveau mot de passe

source: Please enter your old password
ar: يرجى إدخال كلمة المرور القديمة الخاصة بك
fr: Veuillez entrer votre ancien mot de passe

source: Old password
ar: كلمة المرور القديمة
fr: Ancien mot de passe

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: Arabe

# seConnecter
source: Sign In
ar: تسجيل الدخول
fr: Se connecter

# motDePasse
source: Password
ar: كلمة المرور
fr: Mot de passe

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Login
ar: تسجيل الدخول
fr: Connexion

# batterie
source: battery
ar: بطارية
fr: Batterie

# tubeEncre
source: Ink tube
ar: أنبوب الحبر
fr: Tube d'encre

# enveloppesGrandModele
source: Large envelopes
ar: مظاريف كبيرة الحجم
fr: Enveloppes grand modèle

# recueilDesTextesRelatifsAuxElections
source: Collection of texts related to elections
ar: مجموعة النصوص المتعلقة بالانتخابات
fr: Recueil des textes relatifs aux élections

# guideDesOperationsDeVote
source: Voting operations guide
ar: دليل عملية التصويت
fr: Guide des opérations de vote

# mementoDesProceduresApplicablesALelectionPresidentielle
source: Memo of procedures applicable to the presidential election
ar: مذكرة حول الترتيبات القانونيةو الإجراءات التنظيميةالمطبقة على الانتخابات الرئاسية
fr: Mémento des procédures applicables à l’élection présidentielle

# scelles
source: Seals
ar: الأقفال البلاستيكية
fr: Scellés

# flaconsDencreIndelebile
source: Bottles of indelible ink
ar: قنينات الحبر الاصق
fr: Flacons d’encre indélébile

# lampesDeclairage
source: Lighting lamps
ar: مصابيح الإضاءة
fr: Lampes d’éclairage

# isoloirs
source: Voting booths
ar: ستائر
fr: Isoloirs

# cachetAVote
source: Voted stamp
ar: ختم يحمل علامة صوت
fr: Cachet a voté

# encreur
source: Ink pad
ar: الحبر
fr: Encreur

# calculatrice
source: Calculator
ar: آلة حاسبة
fr: Calculatrice

# ciseaux
source: Scissors
ar: مقص
fr: Ciseaux

# stylos
source: Pens
ar: أقلام
fr: Stylos

# scotch
source: Tape
ar: شريط لاصق
fr: Scotch

# regleGraduee
source: Graduated ruler
ar: مسطرة مدرجة
fr: Règle graduée

# gilets
source: Vests
ar: سترات (ملابس موحدة)
fr: Gilets

source: Badges
ar: شارات

# sacGrandFormat
source: Large bag
ar: كيس كبير الحجم
fr: Sac grand format

# autocollantUrne
source: Sticker (ballot box)
ar: ملصق (صندوق الاقتراع)
fr: Autocollant (urne)

# banderole
source: Banner
ar: لافتة
fr: Banderole

source: Material Received
ar: استلام المواد
fr: Matériel Reçu

source: Confirm
ar: تأكيد
fr: Confirmer

source: Confirm Details
ar: تأكيد التفاصيل
fr: Confirmer les détails

source: Quantity
ar: الكمية
fr: Quantité

# requiredFields
source: The fields below are required
ar: الحقول أدناه مطلوبة
fr: Les champs ci-dessous sont requis

# objectReceivedSuccessfully
source: Object is received successfully
ar: تم استلام العنصر بنجاح
fr: L'objet est reçu avec succès

source: Is Complete
ar: مكتمل
fr: Est complet

source: Is Not Complete
ar: غير مكتمل
fr: n'est pas complet

source: Logged Successfully
ar: تم تسجيل الدخول بنجاح
fr: Connecté avec succès

source: Logout successful
ar: تم تسجيل الخروج بنجاح
fr: Déconnexion réussie

source: Error in logout
ar: خطأ في عملية الخروج
fr: Erreur lors de la déconnexion

source: Error in login
ar: خطأ في عملية الدخول
fr: Erreur lors de la connexion

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح
fr: Mot de passe changé avec succès

source: Incorrect old password
ar: كلمة المرور القديمة غير صحيحة
fr: Ancien mot de passe incorrect

source: Version
ar: النسخة

source: Error In Password Change
ar: خطأ في تغيير كلمة المرور
fr: Erreur lors du changement de mot de passe

# formaExceptionMessage
source: Invalid format. Please check your input.
ar: تنسيق غير صالح. يرجى التحقق من إدخالك.
fr: Format invalide. Veuillez vérifier votre saisie.

# timeOutExceptionMessage
source: The operation has timed out. Please try again later.
ar: انتهت المهلة للعملية. يرجى المحاولة مرة أخرى لاحقًا.
fr: L'opération a expiré. Veuillez réessayer plus tard.

# socketExceptionMessage
source: No Internet connection. Please check your network settings.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من إعدادات الشبكة الخاصة بك.
fr: Pas de connexion Internet. Veuillez vérifier vos paramètres réseau.

# httpExceptionMessage
source: Server error. Please try again later.
ar: خطأ في الخادم. يرجى المحاولة مرة أخرى لاحقًا.
fr: Erreur serveur. Veuillez réessayer plus tard.

# platformExceptionMessage
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
fr: Une erreur inattendue s'est produite. Veuillez réessayer.

# authenticationExceptionMessage
source: Authentication failed. Please check your credentials.
ar: فشل المصادقة. يرجى التحقق من بيانات الاعتماد الخاصة بك.
fr: Échec de l'authentification. Veuillez vérifier vos identifiants.

# permissionDeniedExceptionMessage
source: Permission denied. Please grant the necessary permissions.
ar: الإذن مرفوض. يرجى منح الأذونات اللازمة.
fr: Autorisation refusée. Veuillez accorder les permissions nécessaires.

# generalExceptionMessage
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
fr: Une erreur inattendue s'est produite. Veuillez réessayer.

# locationServiceDisabledMessage
source: Location services are disabled. Please enable them to proceed.
ar: خدمات الموقع معطلة. يرجى تمكينها للمتابعة.
fr: Les services de localisation sont désactivés. Veuillez les activer pour continuer.

# locationPermissionDeniedMessage
source: Location permission denied. Please grant location access to continue.
ar: تم رفض إذن الموقع. يرجى منح إذن الوصول إلى الموقع للمتابعة.
fr: Autorisation de localisation refusée. Veuillez accorder l'accès à la localisation pour continuer.
